OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16c925.h
extern __at(0x010E) __sfr LCDPS;

typedef union
  {
  struct
    {
    unsigned LP0                : 1;
    unsigned LP1                : 1;
    unsigned LP2                : 1;
    unsigned LP3                : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned LP                 : 4;
    unsigned                    : 4;
    };
  } __LCDPSbits_t;

extern __at(0x010E) volatile __LCDPSbits_t LCDPSbits;

#define _LP0                    0x01
#define _LP1                    0x02
#define _LP2                    0x04
#define _LP3                    0x08

//==============================================================================


//==============================================================================
//        LCDCON Bits

extern __at(0x010F) __sfr LCDCON;

typedef union
  {
  struct
    {
    unsigned LMUX0              : 1;
    unsigned LMUX1              : 1;
    unsigned CS0                : 1;
    unsigned CS1                : 1;
    unsigned VGEN               : 1;
    unsigned WERR               : 1;
    unsigned SLPEN              : 1;
    unsigned LCDEN              : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned BIAS               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned LMUX               : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 2;
    unsigned CS                 : 2;
    unsigned                    : 4;
    };
  } __LCDCONbits_t;

extern __at(0x010F) volatile __LCDCONbits_t LCDCONbits;

#define _LMUX0                  0x01
#define _LMUX1                  0x02
#define _CS0                    0x04
#define _CS1                    0x08
#define _VGEN                   0x10
#define _BIAS                   0x10
#define _WERR                   0x20
#define _SLPEN                  0x40
#define _LCDEN                  0x80

//==============================================================================


//==============================================================================
//        LCDD00 Bits

extern __at(0x0110) __sfr LCDD00;

typedef struct
  {
  unsigned SEG00                : 1;
  unsigned SEG01                : 1;
  unsigned SEG02                : 1;
  unsigned SEG03                : 1;
  unsigned SEG04                : 1;
  unsigned SEG05                : 1;
  unsigned SEG06                : 1;
  unsigned SEG07                : 1;
  } __LCDD00bits_t;

extern __at(0x0110) volatile __LCDD00bits_t LCDD00bits;

#define _SEG00                  0x01
#define _SEG01                  0x02
#define _SEG02                  0x04
#define _SEG03                  0x08
#define _SEG04                  0x10
#define _SEG05                  0x20
#define _SEG06                  0x40
#define _SEG07                  0x80

//==============================================================================


//==============================================================================
//        LCDD01 Bits

extern __at(0x0111) __sfr LCDD01;

typedef struct
  {
  unsigned SEG08                : 1;
  unsigned SEG09                : 1;
  unsigned SEG10                : 1;
  unsigned SEG11                : 1;
  unsigned SEG12                : 1;
  unsigned SEG13                : 1;
  unsigned SEG14                : 1;
  unsigned SEG15                : 1;
  } __LCDD01bits_t;

extern __at(0x0111) volatile __LCDD01bits_t LCDD01bits;

#define _SEG08                  0x01
#define _SEG09                  0x02
#define _SEG10                  0x04
#define _SEG11                  0x08
#define _SEG12                  0x10
#define _SEG13                  0x20
#define _SEG14                  0x40
#define _SEG15                  0x80

//==============================================================================


//==============================================================================
//        LCDD02 Bits

extern __at(0x0112) __sfr LCDD02;

typedef struct
  {
  unsigned SEG16                : 1;
  unsigned SEG17                : 1;
  unsigned SEG18                : 1;
  unsigned SEG19                : 1;
  unsigned SEG20                : 1;
  unsigned SEG21                : 1;
  unsigned SEG22                : 1;
  unsigned SEG23                : 1;
  } __LCDD02bits_t;

extern __at(0x0112) volatile __LCDD02bits_t LCDD02bits;

#define _SEG16                  0x01
#define _SEG17                  0x02
#define _SEG18                  0x04
#define _SEG19                  0x08
#define _SEG20                  0x10
#define _SEG21                  0x20
#define _SEG22                  0x40
#define _SEG23                  0x80

//==============================================================================


//==============================================================================
//        LCDD03 Bits

extern __at(0x0113) __sfr LCDD03;

typedef struct
  {
  unsigned SEG24                : 1;
  unsigned SEG25                : 1;
  unsigned SEG26                : 1;
  unsigned SEG27                : 1;
  unsigned SEG28                : 1;
  unsigned SEG29                : 1;
  unsigned SEG30                : 1;
  unsigned SEG31                : 1;
  } __LCDD03bits_t;

extern __at(0x0113) volatile __LCDD03bits_t LCDD03bits;

#define _SEG24                  0x01
#define _SEG25                  0x02
#define _SEG26                  0x04
#define _SEG27                  0x08
#define _SEG28                  0x10
#define _SEG29                  0x20
#define _SEG30                  0x40
#define _SEG31                  0x80

//==============================================================================


//==============================================================================
//        LCDD04 Bits

extern __at(0x0114) __sfr LCDD04;

typedef struct
  {
  unsigned SEG00                : 1;
  unsigned SEG01                : 1;
  unsigned SEG02                : 1;
  unsigned SEG03                : 1;
  unsigned SEG04                : 1;
  unsigned SEG05                : 1;
  unsigned SEG06                : 1;
  unsigned SEG07                : 1;
  } __LCDD04bits_t;

