OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16c925.h
extern __at(0x011B) volatile __LCDD11bits_t LCDD11bits;

#define _LCDD11_SEG24           0x01
#define _LCDD11_SEG25           0x02
#define _LCDD11_SEG26           0x04
#define _LCDD11_SEG27           0x08
#define _LCDD11_SEG28           0x10
#define _LCDD11_SEG29           0x20
#define _LCDD11_SEG30           0x40
#define _LCDD11_SEG31           0x80

//==============================================================================


//==============================================================================
//        LCDD12 Bits

extern __at(0x011C) __sfr LCDD12;

typedef struct
  {
  unsigned SEG00                : 1;
  unsigned SEG01                : 1;
  unsigned SEG02                : 1;
  unsigned SEG03                : 1;
  unsigned SEG04                : 1;
  unsigned SEG05                : 1;
  unsigned SEG06                : 1;
  unsigned SEG07                : 1;
  } __LCDD12bits_t;

extern __at(0x011C) volatile __LCDD12bits_t LCDD12bits;

#define _LCDD12_SEG00           0x01
#define _LCDD12_SEG01           0x02
#define _LCDD12_SEG02           0x04
#define _LCDD12_SEG03           0x08
#define _LCDD12_SEG04           0x10
#define _LCDD12_SEG05           0x20
#define _LCDD12_SEG06           0x40
#define _LCDD12_SEG07           0x80

//==============================================================================


//==============================================================================
//        LCDD13 Bits

extern __at(0x011D) __sfr LCDD13;

typedef struct
  {
  unsigned SEG08                : 1;
  unsigned SEG09                : 1;
  unsigned SEG10                : 1;
  unsigned SEG11                : 1;
  unsigned SEG12                : 1;
  unsigned SEG13                : 1;
  unsigned SEG14                : 1;
  unsigned SEG15                : 1;
  } __LCDD13bits_t;

extern __at(0x011D) volatile __LCDD13bits_t LCDD13bits;

#define _LCDD13_SEG08           0x01
#define _LCDD13_SEG09           0x02
#define _LCDD13_SEG10           0x04
#define _LCDD13_SEG11           0x08
#define _LCDD13_SEG12           0x10
#define _LCDD13_SEG13           0x20
#define _LCDD13_SEG14           0x40
#define _LCDD13_SEG15           0x80

//==============================================================================


//==============================================================================
//        LCDD14 Bits

extern __at(0x011E) __sfr LCDD14;

typedef struct
  {
  unsigned SEG16                : 1;
  unsigned SEG17                : 1;
  unsigned SEG18                : 1;
  unsigned SEG19                : 1;
  unsigned SEG20                : 1;
  unsigned SEG21                : 1;
  unsigned SEG22                : 1;
  unsigned SEG23                : 1;
  } __LCDD14bits_t;

extern __at(0x011E) volatile __LCDD14bits_t LCDD14bits;

#define _LCDD14_SEG16           0x01
#define _LCDD14_SEG17           0x02
#define _LCDD14_SEG18           0x04
#define _LCDD14_SEG19           0x08
#define _LCDD14_SEG20           0x10
#define _LCDD14_SEG21           0x20
#define _LCDD14_SEG22           0x40
#define _LCDD14_SEG23           0x80

//==============================================================================


//==============================================================================
//        LCDD15 Bits

extern __at(0x011F) __sfr LCDD15;

typedef struct
  {
  unsigned SEG24                : 1;
  unsigned SEG25                : 1;
  unsigned SEG26                : 1;
  unsigned SEG27                : 1;
  unsigned SEG28                : 1;
  unsigned SEG29                : 1;
  unsigned SEG30                : 1;
  unsigned SEG31                : 1;
  } __LCDD15bits_t;

extern __at(0x011F) volatile __LCDD15bits_t LCDD15bits;

#define _LCDD15_SEG24           0x01
#define _LCDD15_SEG25           0x02
#define _LCDD15_SEG26           0x04
#define _LCDD15_SEG27           0x08
#define _LCDD15_SEG28           0x10
#define _LCDD15_SEG29           0x20
#define _LCDD15_SEG30           0x40
#define _LCDD15_SEG31           0x80

//==============================================================================


//==============================================================================
//        TRISF Bits

extern __at(0x0187) __sfr TRISF;

typedef struct
  {
  unsigned TRISF0               : 1;
  unsigned TRISF1               : 1;
  unsigned TRISF2               : 1;
  unsigned TRISF3               : 1;
  unsigned TRISF4               : 1;
  unsigned TRISF5               : 1;
  unsigned TRISF6               : 1;
  unsigned TRISF7               : 1;
  } __TRISFbits_t;

extern __at(0x0187) volatile __TRISFbits_t TRISFbits;

#define _TRISF0                 0x01
#define _TRISF1                 0x02
#define _TRISF2                 0x04
#define _TRISF3                 0x08
#define _TRISF4                 0x10
#define _TRISF5                 0x20
#define _TRISF6                 0x40
#define _TRISF7                 0x80

//==============================================================================


//==============================================================================
//        TRISG Bits

extern __at(0x0188) __sfr TRISG;

typedef struct
  {
  unsigned TRISG0               : 1;
  unsigned TRISG1               : 1;
  unsigned TRISG2               : 1;
  unsigned TRISG3               : 1;
  unsigned TRISG4               : 1;
  unsigned TRISG5               : 1;
  unsigned TRISG6               : 1;
  unsigned TRISG7               : 1;
  } __TRISGbits_t;

extern __at(0x0188) volatile __TRISGbits_t TRISGbits;

#define _TRISG0                 0x01
#define _TRISG1                 0x02
#define _TRISG2                 0x04
#define _TRISG3                 0x08
#define _TRISG4                 0x10
#define _TRISG5                 0x20
#define _TRISG6                 0x40
#define _TRISG7                 0x80

//==============================================================================

extern __at(0x018C) __sfr PMDATA;
extern __at(0x018D) __sfr PMADR;
extern __at(0x018E) __sfr PMDATH;
extern __at(0x018F) __sfr PMADRH;

//==============================================================================
//
//        Configuration Bits
//
//==============================================================================

#define _CONFIG1                0x2007

//----------------------------- CONFIG1 Options -------------------------------

#define _FOSC_LP                0x3FFC  // LP oscillator.
#define _LP_OSC                 0x3FFC  // LP oscillator.
#define _FOSC_XT                0x3FFD  // XT oscillator.
#define _XT_OSC                 0x3FFD  // XT oscillator.
#define _FOSC_HS                0x3FFE  // HS oscillator.
#define _HS_OSC                 0x3FFE  // HS oscillator.
#define _FOSC_RC                0x3FFF  // RC oscillator.
#define _RC_OSC                 0x3FFF  // RC oscillator.
#define _WDTE_OFF               0x3FFB  // WDT disabled.
#define _WDT_OFF                0x3FFB  // WDT disabled.
#define _WDTE_ON                0x3FFF  // WDT enabled.
#define _WDT_ON                 0x3FFF  // WDT enabled.
#define _PWRTE_ON               0x3FF7  // PWRT enabled.
#define _PWRTE_OFF              0x3FFF  // PWRT disabled.
#define _CP_ALL                 0x3FCF  // All memory is code protected.
#define _CP_75                  0x3FDF  // 0000h-0EFFh code protected.
#define _CP_50                  0x3FEF  // 0000h-07FFh code protected.
#define _CP_OFF                 0x3FFF  // Code protection off.
#define _BOREN_OFF              0x3FBF  // BOR disabled.
#define _BODEN_OFF              0x3FBF  // BOR disabled.
#define _BOREN_ON               0x3FFF  // BOR enabled.
#define _BODEN_ON               0x3FFF  // BOR enabled.

//==============================================================================

#define _DEVID1                 0x2006

#define _IDLOC0                 0x2000
#define _IDLOC1                 0x2001
#define _IDLOC2                 0x2002
#define _IDLOC3                 0x2003

//==============================================================================

